tutorials/lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/Allrun.py.in
#!@PYTHON_EXECUTABLE@

import sys
import os
import os.path
sys.path.insert(0, '@FOAM_PYTHON_DIR@')
from FreeFOAM.compat import *
import FreeFOAM.tutorial

class rhoPisoTwinParcelSimplifiedSiwekRunner(FreeFOAM.tutorial.CaseRunner):
   def __init__(self):
      FreeFOAM.tutorial.CaseRunner.__init__(self,
            'rhoPisoTwinParcel_simplifiedSiwek')
      self._comp = FreeFOAM.tutorial.CompileApp(
            os.path.join(self.case_dir, '..', 'rhoPisoTwinParcelFoam'),
            name='rhoPisoTwinParcel')
      self.add_step('compileRhoPisoTwinParcel', self._comp)
      self.add_app_step('blockMesh')
      self.add_app_step('rhoPisoTwinParcel', self._comp.app)

   def clean(self):
      FreeFOAM.tutorial.CaseRunner.clean(self)
      FreeFOAM.tutorial.clean_application(self._comp.bindir)

if __name__ == '__main__':
   os.chdir(os.path.abspath(os.path.dirname(sys.argv[0])))
   runner = FreeFOAM.tutorial.TutorialRunner()
   runner.add_case(rhoPisoTwinParcelSimplifiedSiwekRunner())
   sys.exit(runner.main())

# ------------------- vim: set sw=3 sts=3 ft=python et: ------------ end-of-file
